using System;

namespace Algorithm
{
    class Program
    {
        /*
         * 알고리즘은 문제를 해결하는 일련의 절차나 방법을 공식으로 표현한 풀이법.
         * 알고리즘을 바탕으로 입력 -> 처리 -> 출력 단계로 진행되는 C#의 절차 지향 프로그래밍 기법도 정리.
         * 
         * 알고리즘이란 프로그래밍을 할 때 생긴 문제의 해결 방법을 체계적으로 정리한 것.
         * 알고리즘은 문제 해결 능력이다.
         * 프로그램의 가장 작은 단위는 일반적으로 입력 -> 처리 -> 출력의 단계를 거치는데, 처리 단계가 알고리즘 단계이다.
         * 입력 : 자료구조가 담당하는 영역.
         *          변수 및 배열의 데이터를 사용하고 컬렉션, 파일, 데이터베이스의 데이터를 사용하는 영역
         * 처리 : 알고리즘 처리 영역
         * 출력 : 화면에 보이는 UI를 담당하는 영역.
         */
    }
}
