using System;

namespace Field
{
    class Program
    {
        /*
         * 필드는 클래스의 부품 역할을 하는 클래스의 내부 상태 값을 저장해 놓는 그릇을 의미.
         * 예를 들어 필드는 자동차 클래스에 선언된 변수로 자동차 부품에 해당한다.
         * 
         * 클래스 내에서 선언된 변수 또는 배열 등을 필드라고 함.
         * 필드는 일반적으로 클래스의 부품 역할을 하며, 대부분 private 액세스 한정자가 붙고,
         * 클래스 내에서 데이터를 담는 그릇 역할을 함. 이러한 필드는 개체 상태를 보관함.
         * 
         * C#에서 변수를 선언할 때 Main() 메소드와 같은 메소드 내에서 선언하거나,
         * 메소드 밖에서 즉, 메소드가 동등한 레벨에서 변수를 선언할 수 있다.
         * 
         * 메소드 내에서 선언된 변수 또는 배열을 지역 변수라고 하고
         * 메소드 밖에서 선언된 변수를 전역변수라고 하는데,
         * c#에서는 전역변수라는 용어를 사용하지 않고 메소드와 동일하게 엑세스 한정자를 붙여 필드라고 함.
         */
    }
}
